Infineon/mtb-xmclib-cat3/CMSIS/Infineon/COMPONENT_XMC4104/Include/XMC4104.h
/* --------------------------------  HRPWM0_HRCCFG  ------------------------------- */
#define HRPWM0_HRCCFG_HRCPM_Pos               (0UL)                     /*!< HRPWM0 HRCCFG: HRCPM (Bit 0)                                */
#define HRPWM0_HRCCFG_HRCPM_Msk               (0x1UL)                   /*!< HRPWM0 HRCCFG: HRCPM (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCFG_HRC0E_Pos               (4UL)                     /*!< HRPWM0 HRCCFG: HRC0E (Bit 4)                                */
#define HRPWM0_HRCCFG_HRC0E_Msk               (0x10UL)                  /*!< HRPWM0 HRCCFG: HRC0E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCFG_HRC1E_Pos               (5UL)                     /*!< HRPWM0 HRCCFG: HRC1E (Bit 5)                                */
#define HRPWM0_HRCCFG_HRC1E_Msk               (0x20UL)                  /*!< HRPWM0 HRCCFG: HRC1E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCFG_HRC2E_Pos               (6UL)                     /*!< HRPWM0 HRCCFG: HRC2E (Bit 6)                                */
#define HRPWM0_HRCCFG_HRC2E_Msk               (0x40UL)                  /*!< HRPWM0 HRCCFG: HRC2E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCFG_HRC3E_Pos               (7UL)                     /*!< HRPWM0 HRCCFG: HRC3E (Bit 7)                                */
#define HRPWM0_HRCCFG_HRC3E_Msk               (0x80UL)                  /*!< HRPWM0 HRCCFG: HRC3E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCFG_CLKC_Pos                (16UL)                    /*!< HRPWM0 HRCCFG: CLKC (Bit 16)                                */
#define HRPWM0_HRCCFG_CLKC_Msk                (0x70000UL)               /*!< HRPWM0 HRCCFG: CLKC (Bitfield-Mask: 0x07)                   */
#define HRPWM0_HRCCFG_LRC0E_Pos               (20UL)                    /*!< HRPWM0 HRCCFG: LRC0E (Bit 20)                               */
#define HRPWM0_HRCCFG_LRC0E_Msk               (0x100000UL)              /*!< HRPWM0 HRCCFG: LRC0E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCFG_LRC1E_Pos               (21UL)                    /*!< HRPWM0 HRCCFG: LRC1E (Bit 21)                               */
#define HRPWM0_HRCCFG_LRC1E_Msk               (0x200000UL)              /*!< HRPWM0 HRCCFG: LRC1E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCFG_LRC2E_Pos               (22UL)                    /*!< HRPWM0 HRCCFG: LRC2E (Bit 22)                               */
#define HRPWM0_HRCCFG_LRC2E_Msk               (0x400000UL)              /*!< HRPWM0 HRCCFG: LRC2E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCFG_LRC3E_Pos               (23UL)                    /*!< HRPWM0 HRCCFG: LRC3E (Bit 23)                               */
#define HRPWM0_HRCCFG_LRC3E_Msk               (0x800000UL)              /*!< HRPWM0 HRCCFG: LRC3E (Bitfield-Mask: 0x01)                  */

/* -------------------------------  HRPWM0_HRCSTRG  ------------------------------- */
#define HRPWM0_HRCSTRG_H0ES_Pos               (0UL)                     /*!< HRPWM0 HRCSTRG: H0ES (Bit 0)                                */
#define HRPWM0_HRCSTRG_H0ES_Msk               (0x1UL)                   /*!< HRPWM0 HRCSTRG: H0ES (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCSTRG_H0DES_Pos              (1UL)                     /*!< HRPWM0 HRCSTRG: H0DES (Bit 1)                               */
#define HRPWM0_HRCSTRG_H0DES_Msk              (0x2UL)                   /*!< HRPWM0 HRCSTRG: H0DES (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCSTRG_H1ES_Pos               (4UL)                     /*!< HRPWM0 HRCSTRG: H1ES (Bit 4)                                */
#define HRPWM0_HRCSTRG_H1ES_Msk               (0x10UL)                  /*!< HRPWM0 HRCSTRG: H1ES (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCSTRG_H1DES_Pos              (5UL)                     /*!< HRPWM0 HRCSTRG: H1DES (Bit 5)                               */
#define HRPWM0_HRCSTRG_H1DES_Msk              (0x20UL)                  /*!< HRPWM0 HRCSTRG: H1DES (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCSTRG_H2ES_Pos               (8UL)                     /*!< HRPWM0 HRCSTRG: H2ES (Bit 8)                                */
#define HRPWM0_HRCSTRG_H2ES_Msk               (0x100UL)                 /*!< HRPWM0 HRCSTRG: H2ES (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCSTRG_H2DES_Pos              (9UL)                     /*!< HRPWM0 HRCSTRG: H2DES (Bit 9)                               */
#define HRPWM0_HRCSTRG_H2DES_Msk              (0x200UL)                 /*!< HRPWM0 HRCSTRG: H2DES (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCSTRG_H3ES_Pos               (12UL)                    /*!< HRPWM0 HRCSTRG: H3ES (Bit 12)                               */
#define HRPWM0_HRCSTRG_H3ES_Msk               (0x1000UL)                /*!< HRPWM0 HRCSTRG: H3ES (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCSTRG_H3DES_Pos              (13UL)                    /*!< HRPWM0 HRCSTRG: H3DES (Bit 13)                              */
#define HRPWM0_HRCSTRG_H3DES_Msk              (0x2000UL)                /*!< HRPWM0 HRCSTRG: H3DES (Bitfield-Mask: 0x01)                 */

/* -------------------------------  HRPWM0_HRCCTRG  ------------------------------- */
#define HRPWM0_HRCCTRG_H0EC_Pos               (0UL)                     /*!< HRPWM0 HRCCTRG: H0EC (Bit 0)                                */
#define HRPWM0_HRCCTRG_H0EC_Msk               (0x1UL)                   /*!< HRPWM0 HRCCTRG: H0EC (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCTRG_H0DEC_Pos              (1UL)                     /*!< HRPWM0 HRCCTRG: H0DEC (Bit 1)                               */
#define HRPWM0_HRCCTRG_H0DEC_Msk              (0x2UL)                   /*!< HRPWM0 HRCCTRG: H0DEC (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCCTRG_H1EC_Pos               (4UL)                     /*!< HRPWM0 HRCCTRG: H1EC (Bit 4)                                */
#define HRPWM0_HRCCTRG_H1EC_Msk               (0x10UL)                  /*!< HRPWM0 HRCCTRG: H1EC (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCTRG_H1DEC_Pos              (5UL)                     /*!< HRPWM0 HRCCTRG: H1DEC (Bit 5)                               */
#define HRPWM0_HRCCTRG_H1DEC_Msk              (0x20UL)                  /*!< HRPWM0 HRCCTRG: H1DEC (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCCTRG_H2CEC_Pos              (8UL)                     /*!< HRPWM0 HRCCTRG: H2CEC (Bit 8)                               */
#define HRPWM0_HRCCTRG_H2CEC_Msk              (0x100UL)                 /*!< HRPWM0 HRCCTRG: H2CEC (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCCTRG_H2DEC_Pos              (9UL)                     /*!< HRPWM0 HRCCTRG: H2DEC (Bit 9)                               */
#define HRPWM0_HRCCTRG_H2DEC_Msk              (0x200UL)                 /*!< HRPWM0 HRCCTRG: H2DEC (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRCCTRG_H3EC_Pos               (12UL)                    /*!< HRPWM0 HRCCTRG: H3EC (Bit 12)                               */
#define HRPWM0_HRCCTRG_H3EC_Msk               (0x1000UL)                /*!< HRPWM0 HRCCTRG: H3EC (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRCCTRG_H3DEC_Pos              (13UL)                    /*!< HRPWM0 HRCCTRG: H3DEC (Bit 13)                              */
#define HRPWM0_HRCCTRG_H3DEC_Msk              (0x2000UL)                /*!< HRPWM0 HRCCTRG: H3DEC (Bitfield-Mask: 0x01)                 */

